test/fixtures/order_before_refund.json

{
	"id": 762815840312,
	"email": "kevinhughes27@gmail.com",
	"closed_at": null,
	"created_at": "2018-12-28T08:26:30-05:00",
	"updated_at": "2018-12-28T08:26:30-05:00",
	"number": 29,
	"note": "",
	"token": "a5a4902013d7114fe991e88c349c1d66",
	"gateway": "bogus",
	"test": true,
	"total_price": "457.74",
	"subtotal_price": "398.00",
	"total_weight": 2000,
	"total_tax": "51.74",
	"taxes_included": false,
	"currency": "USD",
	"financial_status": "paid",
	"confirmed": true,
	"total_discounts": "0.00",
	"total_line_items_price": "398.00",
	"cart_token": "60ba37ef8e467715e33c24d9b5f51319",
	"buyer_accepts_marketing": false,
	"name": "#1029",
	"referring_site": "https://kevintest3.myshopify.com/admin/apps/f285bf72d01ffd4fcec7199f2283d465/",
	"landing_site": "/admin/auth/login",
	"cancelled_at": null,
	"cancel_reason": null,
	"total_price_usd": "457.74",
	"checkout_token": "1ae6e7c658589027450f814d165c2161",
	"reference": null,
	"user_id": null,
	"location_id": null,
	"source_identifier": null,
	"source_url": null,
	"processed_at": "2018-12-28T08:26:29-05:00",
	"device_id": null,
	"phone": null,
	"customer_locale": "en",
	"app_id": 580111,
	"browser_ip": "113.210.196.74",
	"landing_site_ref": null,
	"order_number": 1029,
	"discount_applications": [],
	"discount_codes": [],
	"note_attributes": [],
	"payment_gateway_names": ["bogus"],
	"processing_method": "direct",
	"checkout_id": 5372669853752,
	"source_name": "web",
	"fulfillment_status": null,
	"tax_lines": [{
		"price": "51.74",
		"rate": 0.13,
		"title": "HST",
		"price_set": {
			"shop_money": {
				"amount": "51.74",
				"currency_code": "USD"
			},
			"presentment_money": {
				"amount": "51.74",
				"currency_code": "USD"
			}
		}
	}],
	"tags": "",
	"contact_email": "kevinhughes27@gmail.com",
	"order_status_url": "https://kevintest3.myshopify.com/10518540/orders/a5a4902013d7114fe991e88c349c1d66/authenticate?key=cda5090d6487f93cf686deb2eccbc755",
	"presentment_currency": "USD",
	"total_line_items_price_set": {
		"shop_money": {
			"amount": "398.00",
			"currency_code": "USD"
		},
		"presentment_money": {
			"amount": "398.00",
			"currency_code": "USD"
		}
	},
	"total_discounts_set": {
		"shop_money": {
			"amount": "0.00",
			"currency_code": "USD"
		},
		"presentment_money": {
			"amount": "0.00",
			"currency_code": "USD"
		}
	},
	"total_shipping_price_set": {
		"shop_money": {
			"amount": "8.00",
			"currency_code": "USD"
		},
		"presentment_money": {
			"amount": "8.00",
			"currency_code": "USD"
		}
	},
	"subtotal_price_set": {
		"shop_money": {
			"amount": "398.00",
			"currency_code": "USD"
		},
		"presentment_money": {
			"amount": "398.00",
			"currency_code": "USD"
		}
	},
	"total_price_set": {
		"shop_money": {
			"amount": "457.74",
			"currency_code": "USD"
		},
		"presentment_money": {
			"amount": "457.74",
			"currency_code": "USD"
		}
	},
	"total_tax_set": {
		"shop_money": {
			"amount": "51.74",
			"currency_code": "USD"
		},
		"presentment_money": {
			"amount": "51.74",
			"currency_code": "USD"
		}
	},
	"total_tip_received": "0.0",
	"line_items": [{
		"id": 2435146022968,
		"variant_id": 8027085573,
		"title": "Axis2",
		"quantity": 2,
		"price": "199.00",
		"sku": "GD802-025",
		"variant_title": "162cm",
		"vendor": "Nidecker",
		"fulfillment_service": "manual",
		"product_id": 2757640645,
		"requires_shipping": true,
		"taxable": true,
		"gift_card": false,
		"name": "Axis2 - 162cm",
		"variant_inventory_management": "shopify",
		"properties": [],
		"product_exists": true,
		"fulfillable_quantity": 2,
		"grams": 1000,
		"total_discount": "0.00",
		"fulfillment_status": null,
		"price_set": {
			"shop_money": {
				"amount": "199.00",
				"currency_code": "USD"
			},
			"presentment_money": {
				"amount": "199.00",
				"currency_code": "USD"
			}
		},
		"total_discount_set": {
			"shop_money": {
				"amount": "0.00",
				"currency_code": "USD"
			},
			"presentment_money": {
				"amount": "0.00",
				"currency_code": "USD"
			}
		},
		"discount_allocations": [],
		"tax_lines": [{
			"title": "HST",
			"price": "51.74",
			"rate": 0.13,
			"price_set": {
				"shop_money": {
					"amount": "51.74",
					"currency_code": "USD"
				},
				"presentment_money": {
					"amount": "51.74",
					"currency_code": "USD"
				}
			}
		}],
		"origin_location": {
			"id": 699016581,
			"country_code": "CA",
			"province_code": "ON",
			"name": "kevintest3",
			"address1": "150 Elgin",
			"address2": "",
			"city": "Ottawa",
			"zip": "K1P2Z8"
		}
	}],
	"shipping_lines": [{
		"id": 639720456248,
		"title": "Standard Shipping",
		"price": "8.00",
		"code": "Standard Shipping",
		"source": "shopify",
		"phone": null,
		"requested_fulfillment_service_id": null,
		"delivery_category": null,
		"carrier_identifier": null,
		"discounted_price": "8.00",
		"price_set": {
			"shop_money": {
				"amount": "8.00",
				"currency_code": "USD"
			},
			"presentment_money": {
				"amount": "8.00",
				"currency_code": "USD"
			}
		},
		"discounted_price_set": {
			"shop_money": {
				"amount": "8.00",
				"currency_code": "USD"
			},
			"presentment_money": {
				"amount": "8.00",
				"currency_code": "USD"
			}
		},
		"discount_allocations": [],
		"tax_lines": []
	}],
	"billing_address": {
		"first_name": "Kevin",
		"address1": "10 Dover Court",
		"phone": null,
		"city": "Ottawa",
		"zip": "K5P 4H3",
		"province": "Ontario",
		"country": "Canada",
		"last_name": "Hughes",
		"address2": "",
		"company": null,
		"latitude": 45.2668591,
		"longitude": -75.7149008,
		"name": "Kevin Hughes",
		"country_code": "CA",
		"province_code": "ON"
	},
	"shipping_address": {
		"first_name": "Kevin",
		"address1": "10 Dover Court",
		"phone": null,
		"city": "Ottawa",
		"zip": "K5P 4H3",
		"province": "Ontario",
		"country": "Canada",
		"last_name": "Hughes",
		"address2": "",
		"company": null,
		"latitude": 45.2668591,
		"longitude": -75.7149008,
		"name": "Kevin Hughes",
		"country_code": "CA",
		"province_code": "ON"
	},
	"fulfillments": [],
	"client_details": {
		"browser_ip": "113.210.196.74",
		"accept_language": "en-US,en;q=0.9",
		"user_agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36",
		"session_hash": "8c75b546bc922f0ecf05010f41305096",
		"browser_width": 1648,
		"browser_height": 1005
	},
	"refunds": [],
	"payment_details": {
		"credit_card_bin": "1",
		"avs_result_code": null,
		"cvv_result_code": null,
		"credit_card_number": "•••• •••• •••• 1",
		"credit_card_company": "Bogus"
	},
	"customer": {
		"id": 929937489976,
		"email": "kevinhughes27@gmail.com",
		"accepts_marketing": false,
		"created_at": "2018-12-28T08:26:05-05:00",
		"updated_at": "2018-12-28T08:26:30-05:00",
		"first_name": "Kevin",
		"last_name": "Hughes",
		"orders_count": 0,
		"state": "disabled",
		"total_spent": "0.00",
		"last_order_id": null,
		"note": null,
		"verified_email": true,
		"multipass_identifier": null,
		"tax_exempt": false,
		"phone": null,
		"tags": "",
		"last_order_name": null,
		"currency": "USD",
		"default_address": {
			"id": 964977131576,
			"customer_id": 929937489976,
			"first_name": "Kevin",
			"last_name": "Hughes",
			"company": null,
			"address1": "10 Dover Court",
			"address2": "",
			"city": "Ottawa",
			"province": "Ontario",
			"country": "Canada",
			"zip": "K5P 4H3",
			"phone": null,
			"name": "Kevin Hughes",
			"province_code": "ON",
			"country_code": "CA",
			"country_name": "Canada",
			"default": true
		}
	}
}
